# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet..::..Insert Method
WireConduitTypeSet Class See Also
---
Insert the specified conduit type into the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	WireConduitType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As WireConduitType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	WireConduitType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireConduitTypeThe conduit type to be inserted into the set.
# ### Return Value
Returns whether the conduit type was inserted into the set.
# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace